import os

CHANNEL_ID = -69234958625333
MAX_BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")
BOT_TOKEN = os.getenv("MAX_BOT_TOKEN") or os.getenv("MAX_TOKEN") or os.getenv("BOT_TOKEN")

# --- ССЫЛКИ ---
CHANNEL_URL = "https://max.ru/id3015065824_gos"
SITE_URL = "https://school-kuznecov30.ru"
FORM_URL = "https://pos.gosuslugi.ru/landing/"

# --- ТЕКСТЫ ---
TEXT_SUBSCRIBE = (
    "Для того чтобы продолжить использовать бот, необходимо подписаться на канал\n"
    "ГБУ ДО АО «СШОР им. Б.Г. Кузнецова».\n\n"
    "Для этого нажмите «Открыть канал» или перейдите по ссылке:\n"
    f"{CHANNEL_URL}\n\n"
    "Затем вернитесь в чат-бот и нажмите «Я подписан»."
)

TEXT_WELCOME = (
    "Добро пожаловать в чат-бот ГБУ ДО АО «СШОР им. Б.Г. Кузнецова»!\n\n"
    "Выберите нужную категорию:"
)

TEXT_ABOUT = (
    "Государственное бюджетное учреждение дополнительного образования Астраханской области «Спортивная школа олимпийского резерва им. Б.Г. Кузнецова» (сокращенное название ГБУ ДО АО «СШОР им. Б.Г. Кузнецова») – это не просто место для занятий спортом, это сообщество единомышленников, где царит атмосфера поддержки, дружбы и стремления к совершенству. Это место, где юные астраханцы получают шанс раскрыть свой потенциал, научиться преодолевать трудности и достигать поставленных целей, следуя по стопам великого олимпийского чемпиона. Школа продолжает оставаться важным центром развития единоборств в Астраханской области, внося неоценимый вклад в спортивное будущее региона и страны. Спортивная школа олимпийского резерва с 2013 года носит имя выдающегося человека, Олимпийского чемпиона Бориса Георгиевича Кузнецова. Борис Кузнецов родился в1947 году, в Астрахани. начал свой путь в боксе с юных лет. Его талант, упорство и трудолюбие быстро привели его к значительным успехам на внутренней арене. Он становился чемпионом СССР, демонстрируя не только техническую оснащенность, но и характер настоящего бойца. Однако настоящим испытанием и вершиной его карьеры стала Олимпиада в Мюнхене 1972 года, где Борис Георгиевич провел 6 боев и завоевал олимпийское золото. Победа Бориса Кузнецова в Мюнхене стала ярким примером для молодого поколения спортсменов. Он доказал, что благодаря упорному труду, вере в себя и несгибаемой воле можно достичь самых высоких целей. Его олимпийское золото – это не просто медаль, а символ триумфа советской школы бокса и выдающегося спортсмена, чье имя навсегда вписано в историю мирового спорта. После завершения спортивной карьеры Борис Кузнецов продолжал вносить вклад в развитие  Астраханского бокса, занимаясь тренерской деятельностью и передавая свой бесценный опыт молодым талантам. Его наследие живет в сердцах тех, кто восхищается его спортивными достижениями и черпает вдохновение в его примере. На данный момент наша школа является базовым учреждением по подготовке спортивного резерва для сборных команд Астраханской области и России. В школе культивируются 6 видов единоборств бокс, вольная борьба, греко-римская борьба, дзюдо,  тхэквондо, рукопашный бой.  Более 1000 человек проходят спортивную подготовку. За время существования школы подготовлено более 120 мастеров спорта, 11 мастеров спорта международного класса. Тренировочный процесс в нашем учреждении проводят заслуженные тренеры России, мастера спорта, отличники физической культуры и спорта.\n"
    "Основные задачи нашей спортивной школы:\n"
    "- обеспечение подготовки спортивного резерва для спортивных сборных команд Астраханской области и Российской Федерации;\n"
    "- обеспечение участия лиц, проходящих спортивную подготовку, в спортивных соревнованиях, в международных соревнованиях, участия в официальных физкультурных (физкультурно-оздоровительных) мероприятиях;\n"
    "- организация и обеспечение подготовки спортивного резерва, спортивных сборных команд;\n"
    "- организация и проведение официальных спортивных мероприятий;\n"
)

TEXT_ADDRESSES = (
    "📍 **Адреса учреждения**\n"
    "Основное здание:\n"
    "• г. Астрахань, ул. Ленина, 3\n"
    "Залы и тренировочные базы:\n" 
    "• г. Астрахань, ул. Бэра/Бежецкая, 47а/20;\n"
    "• г. Астрахань, ул. Красная Набережная, 171;\n"
    "• г. Астрахань, ул. Шаумяна, стр. 14А;\n"
    "• г. Астрахань, ул. Джона Рида, 37;\n"
    "• г. Астрахань, ул. Николая Островского, стр. 148Е;\n"
    "• г. Астрахань, с. Новолесное, ул.Алексеева,12а;\n"
    "• Астраханская область, Наримановский район, с. Солянка, ул. Ленина, 3в;\n"
    "• Астраханская область, Приволжский район, с. Яксатово, ул. Школьная,1;\n"
    "• Астраханская область, Икрянинский район, п. Красные Баррикады, «Первомайская», 5А.\n"
)

TEXT_PAID_SERVICES = (
    "💳 **Платные услуги**\n\n"
    "Здесь описаны платные услуги центра. Подробнее — на официальном сайте."
)

TEXT_CONTACTS = (
    "📞 **Контактная информация**\n\n"
    "• Телефоны: +7 (8512) 24-13-64,  +7 (8512) 24-56-26\n"
    "• Телефон вахты: +7 (8512) 51-90-09\n"
    "• Email: shsport1@sshorkuznecov.astrobl.ru\n"
    "• Прием граждан: Вт, Чт с 14:00 по 17:00.\n"
    "• Прием граждан директором спортивной школы: Чт с 14:00 до 17:00.\n"
    "**Режим работы:**\n" 
    "понедельник–пятница, с 08:30 до 17:30 (перерыв с 12:00 до 13:00)"
)

TEXT_SUPPORT_MENU = (
    "❓ **Часто задаваемые вопросы**\n\n"
    "Выберите направление:"
)

SUPPORT_DATA = {
    "question_1": (
        "✅ **Ответ:**\n\n"
        "Возраст приема (как на бюджетную так и на платную основу):\n"
        "• вольная борьба, греко-римская борьба, тхэквондо, дзюдо – с 7 лет;\n"
        "• бокс – с 9 лет;\n"
        "• рукопашный бой – с 10 лет."
    ),
    "question_2": (
        "✅ **Ответ:**\n\n"
        "Программы подготовки:\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «БОКС»;\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «ТХЭКВОНДО»;\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «СПОРТИВНАЯ БОРЬБА (ДИСЦИПЛИНА «ВОЛЬНАЯ БОРЬБА»);\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «СПОРТИВНАЯ БОРЬБА (ДИСЦИПЛИНА «ГРЕКО-РИМСКАЯ БОРЬБА»);\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «ДЗЮДО»;\n"
        "• дополнительная образовательная программа спортивной подготовки по виду спорта «РУКОПАШНЫЙ БОЙ»;\n"
        "• дополнительная общеобразовательная общеразвивающая программа по виду спорта «БОКС»;\n"
        "• дополнительная общеобразовательная общеразвивающая программа по виду спорта «ТХЭКВОНДО»;\n"
        "• дополнительная общеобразовательная общеразвивающая программа по виду спорта «СПОРТИВНАЯ БОРЬБА»;\n"
        "• дополнительная общеобразовательная общеразвивающая программа по виду спорта «ДЗЮДО»;\n"
        "• дополнительная общеобразовательная общеразвивающая программа по виду спорта «РУКОПАШНЫЙ БОЙ».\n"
    ),
    "question_3": (
        "✅ **Ответ:**\n\n"
        "Бокс;\n"
        "Дзюдо;\n"
        "Вольная борьба;\n"
        "Греко-римская борьба;\n"
        "Тхэквондо;\n" 
        "Рукопашный бой.\n"
    ),
}
